app/views/products/modals/_createModal.html.erb

SELECT  "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
           </ul>
           <%= f.number_field :position, :value=> Admin.first.products_last_position, :style=> 'display:none' %>