app/controllers/admin_controller.rb

	def login
	  if params[:admin][:username].present? && params[:admin][:password].present?
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["username", "simplerails"], ["LIMIT", 1]]

	def load_partial
		@admin = Admin.first
---
SELECT  "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]