app/controllers/api_controller.rb

			@event_hash[counter][:text] = event.text
		end

		@admin = Admin.first
---
SELECT  "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]