app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@empty_field_flag = false

		params[:article].values.each do |param|
		  if !param.present?
		  	@empty_field_flag = true
		  end
		end

		if !@empty_field_flag
			if @article.save(article_params)
---
SELECT "articles".* FROM "articles"
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-03-05 22:14:16 UTC], ["updated_at", 2017-03-05 22:14:16 UTC]]